Dlubal.RFEM5.ICoordinateSystem
Interface for working with coordinate system

Dlubal.RFEM5.ICoordinateSystem.GetData
Gets coordinate system parameters.
Returns: Coordinate system parameters

Dlubal.RFEM5.ICoordinateSystem.GetNormal
Gets normal vector.
Returns: Normal vector

Dlubal.RFEM5.ICoordinateSystem.LocalToGlobal(System.UInt32@)
Converts local point to global point.
Returns: Point in global coordinate system
Local: Point in local coordinate system

Dlubal.RFEM5.ICoordinateSystem.GlobalToLocal(System.UInt32@)
Converts global point to local point.
Returns: Point in local coordinate system
Global: Point in global coordinate system